#3. Дан список размера N, все элементы которого, кроме последнего, упорядочены по
#возрастанию. Сделать список упорядоченным, переместив последний элемент на
#новую позицию.

lst = [3, 5, 7, 9, 15, 1]
lst.sort(key=None, reverse= False)
print(lst)
