#1. Дан список размера N и целые числа K и L (1 < K < L < N). Найти сумму элементов
#списка с номерами от K до L включительно.

lst = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
K = 2
L = 4

sum_result = 0
for i in range(K, L + 1):
    sum_result += lst[i]

print("Сумма элементов списка:" , sum_result )